# Terraform environment at21
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTQ1MTc3YTBhLWQyN2UtNDkwZi05ZjIzLWI0NzI2ZGU4Y2NjMTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_virtual_network.hub_vnet: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.admin will be created
  + resource "azurerm_federated_identity_credential" "admin" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "GitHubAction"
      + parent_id           = "/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgaltinnauth001at21/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at21"
      + resource_group_name = "rgaltinnauth001at21"
      + subject             = "repo:Altinn/altinn-authorization-tmp:environment:at21"
    }

  # azurerm_role_assignment.key_vault_administrator will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cf697678-661d-408f-b9ea-8990a6adc620"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/45177a0a-d27e-490f-9f23-b4726de8ccc1/resourceGroups/rgaltinnauth001at21/providers/Microsoft.KeyVault/vaults/kvaltinnauth001at21"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at21/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at21_spokes.tfstate.tfplan`